move "/"                           to routing-pattern(1).
move "indexweb"                    to routing-destiny(1).

move "/showsum/%value1/%value2"    to routing-pattern(2).
move "showsum"                     to routing-destiny(2).

move "/showname/%value"            to routing-pattern(3).
move "showname"                    to routing-destiny(3).

